renesas/ra-fsp-examples/application_projects/r01an6815/Firmware_Update_from_BLE_Radio_OTA/bleapp_fwupdate_ryz012_ra4m2_baremetal/qe_gen/ble/profile_cmn/r_ble_servc_if.c
ble_status_t R_BLE_SERVC_WriteCmdChar(
    const st_ble_servc_char_info_t *p_attr, uint16_t conn_hdl, const void *p_app_value)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_app_value))
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint8_t *p_byte_value;
    p_byte_value = malloc(p_attr->db_size);
    memset(p_byte_value, 0x00, p_attr->db_size);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = (uint16_t)(p_attr->p_attr_hdls[conn_idx].start_hdl + 1),
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        return BLE_ERR_INVALID_DATA;
    }

    ret = R_BLE_GATTC_WriteCharWithoutRsp(conn_hdl, &write_data);

    free(p_byte_value);

    return ret;
}

ble_status_t R_BLE_SERVC_ReadDesc(const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl)
{
    if (NULL == p_attr)
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (p_attr->db_size <= (mtu - 1))
    {
        return R_BLE_GATTC_ReadChar(conn_hdl, p_attr->p_attr_hdls[conn_idx]);
    }
    else
    {
        return R_BLE_GATTC_ReadLongChar(conn_hdl, p_attr->p_attr_hdls[conn_idx], 0);
    }
}

ble_status_t R_BLE_SERVC_ReadDesc_with_Type(const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl, int32_t type)
{
    if (NULL == p_attr)
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (0 == type)
    {
        return R_BLE_GATTC_ReadChar(conn_hdl, p_attr->p_attr_hdls[conn_idx]);
    }
    else
    {
        return R_BLE_GATTC_ReadLongChar(conn_hdl, p_attr->p_attr_hdls[conn_idx], 0);
    }
}



ble_status_t R_BLE_SERVC_WriteDesc(
    const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl, const void *p_app_value)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_app_value))
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint8_t *p_byte_value;
    p_byte_value = malloc(p_attr->db_size);
    memset(p_byte_value, 0x00, p_attr->db_size);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = p_attr->p_attr_hdls[conn_idx],
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        return BLE_ERR_INVALID_DATA;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (p_attr->db_size <= (mtu - 3))
    {
        ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
    }
    else
    {
        ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
    }

    free(p_byte_value);

    return ret;
}

ble_status_t R_BLE_SERVC_WriteDesc2(
    const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl, const void *p_app_value)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_app_value))
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint8_t *p_byte_value;
    p_byte_value = malloc(p_attr->db_size);
    memset(p_byte_value, 0x00, p_attr->db_size);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = p_attr->p_attr_hdls[conn_idx],
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        return BLE_ERR_INVALID_DATA;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (write_data.value.value_len <= (mtu - 3))
    {
        ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
    }
    else
    {
        ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
    }

    free(p_byte_value);

    return ret;
}



ble_status_t R_BLE_SERVC_WriteDesc_with_Size(
    const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl, const st_ble_seq_data_t *p_app_value)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_app_value))
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint8_t *p_byte_value;
    uint16_t write_len;
    write_len = (p_app_value->len < p_attr->db_size) ? p_app_value->len : p_attr->db_size;

    p_byte_value = malloc(write_len);
    memset(p_byte_value, 0x00, write_len);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = write_len,
    };

    //ret = p_attr->encode(p_app_value, &gatt_value);
    ret = p_attr->encode(p_app_value->data, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = p_attr->p_attr_hdls[conn_idx],
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        return BLE_ERR_INVALID_DATA;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (write_len <= (mtu - 3))
    {
        ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
    }
    else
    {
        ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
    }

    free(p_byte_value);

    return ret;
}




